blog_post_challenge/app/controllers/blog_controller.rb

SELECT "blogs".* FROM "blogs"
---
    def index
        @blog = Blog.all

INSERT INTO "blogs" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "testest"], ["content", "testsetes"], ["created_at", "2022-03-23 23:15:45.732053"], ["updated_at", "2022-03-23 23:15:45.732053"]]
---
    def create
        @blog = Blog.create(blog_params)

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = $1  [["id", 5]]
---
    def destroy
        @blog = Blog.find(params[:id])
        @blog.destroy

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "blogs" SET "content" = $1, "updated_at" = $2 WHERE "blogs"."id" = $3  [["content", "we did things and stuff"], ["updated_at", "2022-03-24 17:18:02.465710"], ["id", 5]]
---
    def update
        @blog = Blog.find(params[:id])

        # full_params = params
        # # full params = {}
        # blog_params = params[:blog]
        # # blog_params = {}
        # # [:key] is how you access a value in a hash
        # blog_title = blog_params[:title]

        # puts 'test'
        # puts params
        # puts params[:title]
        # puts 'test'

        # @blog.title = params[:blog][:title]
        # @blog.content = params[:blog][:content]
        # @blog.save

        # @blog.update({title: 'test title', content: 'test content'})

        # this should fail because of strong params
        # @blog.update(params[:blog])

        update_res = @blog.update(blog_params)